modm-ext/data.modm.io/docs/svd/header_stm32wb55xx.svd
        <register>
          <name>C2IMR2</name>
          <description>SYSCFG CPU2 (CORTEX M0) interrupt masks control-status register part 2</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA1CH1IM</name>
              <description>Enabling of interrupt from DMA1 Channel 1 to CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH2IM</name>
              <description>Enabling of interrupt from DMA1 Channel 2 to CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH3IM</name>
              <description>Enabling of interrupt from DMA1 Channel 3 to CPU2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH4IM</name>
              <description>Enabling of interrupt from DMA1 Channel 4 to CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH5IM</name>
              <description>Enabling of interrupt from DMA1 Channel 5 to CPU2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH6IM</name>
              <description>Enabling of interrupt from DMA1 Channel 6 to CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH7IM</name>
              <description>Enabling of interrupt from DMA1 Channel 7 to CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH1IM</name>
              <description>Enabling of interrupt from DMA2 Channel 1 to CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH2IM</name>
              <description>Enabling of interrupt from DMA2 Channel 2 to CPU2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH3IM</name>
              <description>Enabling of interrupt from DMA2 Channel 3 to CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH4IM</name>
              <description>Enabling of interrupt from DMA2 Channel 4 to CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH5IM</name>
              <description>Enabling of interrupt from DMA2 Channel 5 to CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH6IM</name>
              <description>Enabling of interrupt from DMA2 Channel 6 to CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH7IM</name>
              <description>Enabling of interrupt from DMA2 Channel 7 to CPU2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUX1IM</name>
              <description>Enabling of interrupt from DMAMUX1 to CPU2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM1IM</name>
              <description>Enabling of interrupt from Power Voltage Monitoring 1 to CPU2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM3IM</name>
              <description>Enabling of interrupt from Power Voltage Monitoring 3 to CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDIM</name>
              <description>Enabling of interrupt from Power Voltage Detector to CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSCIM</name>
              <description>Enabling of interrupt from Touch Sensing Controller to CPU2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCDIM</name>
              <description>Enabling of interrupt from Liquid Crystal Display to CPU2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIPCR</name>
          <description>SYSCFG secure IP control register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAES1</name>
              <description>Enabling the security access of Advanced Encryption Standard 1 KEY[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAES2</name>
              <description>Enabling the security access of Advanced Encryption Standard 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPKA</name>
              <description>Enabling the security access of Public Key Accelerator</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRNG</name>
              <description>Enabling the security access of Random Number Generator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
